<%@ page language="java" contentType="text/html; charset=utf-8"
    pageEncoding="utf-8"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>五指棋介绍</title>
<style type="text/css">
	.IntroduceContent{
		margin:0 auto;
		width:60%;
	}
	h4{
		margin-bottom:2px 0;
	}
</style>
</head>
<body>
<div class="IntroduceContent">
<div class = "Content">
	<h4>五指棋博弈说明</h4>
	<div class="SimpleIntroduction">
		<h4>介绍</h4>
		<p>五子棋是世界智力运动会竞技项目之一，是一种两人对弈的纯策略型棋类游戏，是世界智力运动会竞技项目之一，通常双方分别使用黑白两色的棋子，下在棋盘直线与横线的交叉点上，先形成5子连线者获胜。</p>	
	</div>
	<div>
		<h4>追根溯源</h4>
		<p>五子棋起源于我国古代，属黑白棋种之一。大约在南北朝时期通过高丽(朝鲜)传入日本。近百多年来日本对五子棋规则进行了一系列改良，如通过逐步设立黑方的三三、四四和长连禁手，指定开局、三手交换、五手两打等，使五子棋这一简单的游戏复杂化、规范化，最终使五子棋发展成为国际上广为认可的竞技棋类项目(日本等国也称竞技五子棋为连珠)。</p>
	</div>
	<div>
		<h4>博弈规则</h4>
		<p>(1)对局双方各执一色棋子。
			(2)空棋盘开局。
			(3)黑先、白后，交替下子，每次只能下一子。
			(4)棋子下在棋盘的空白点上，棋子下定后，不得向其它点移动，不得从棋盘上拿掉或拿起另落别处。
			(5)黑方的第一枚棋子可下在棋盘任意交叉点上。
			(6)轮流下子是双方的权利，但允许任何一方放弃下子权（即：PASS权）
			五子棋对局，执行黑方指定开局、三手可交换、五手两打的规定。整个对局过程中黑方有禁手，白方无禁手。黑方禁手有三三禁手、四四禁手和长连禁手三种。</p>
	</div>
	<div>
		<h4>五子棋入门技巧口诀</h4>
		<p>先手要攻，后手要守。 以攻为守，以守为攻。 攻守转换，慎思变化。 先行争夺，地破天惊。 守取外势，攻聚内力。 八卦易守，成角易攻。 阻断分割，稳如泰山。 不思争先，胜如登天。 初盘争二，局终抢三。 留三不冲，变化万千。 多个先手，细算次先。 五子要点，次序在前。 斜线为阴，直线为阳。 阴阳结合，防不胜防。 连三连四，易见为明。 跳三跳四，暗箭深藏。 己落一子，敌增一兵。 攻其要点，守其必争。 势已形成，败即降临。 五子精华，一子输赢。</p>
	</div>
	<div hidden="hidden">
	先手要攻，后手要守 
这句话的表面意思应该很容易理解，先手当然应该进攻，不要贻误时机。但有些时候局面并不是一边倒的形势，这就需要认真判断自己到底是不是真正的先手，如果前途暗淡，而对方也有些手段，就要小心了，冒然进攻，用完了自己的力量，再去防守对手，就成了彻底的后手。

以攻为守，以守待攻 
攻 不忘守，守不忘攻。有句话叫“最强的防守就是进攻”，防守别人棋的时候仔细看清局势，是不是有既能防守住对方又可以进攻的点。以守待攻，在对方狂攻一阵却 无胜棋后，你防守的棋是否形成了外围的攻势？在安全的前提下，防守对方的棋最好不要太消极，等他攻完，就可以利用防守时形成的攻势轻松收拾对方。

攻守转换，慎思变化 
发 现进攻没有胜棋，而对方防守的子力形成了一定的威胁，一般就会转攻为守了。或者守住了对方的进攻，得到先手而转守为攻。攻守转换的时候，要分析局面，有些 冲四、活三是不是该先下了再去防守更好？还是冲后以后再防守会变得更困难？以守转攻的时候，要看清是不是真的已经完全守住了对方？他还有哪些力量，能不能 够成威胁？

先行争夺，地破天惊 
用妙手强行夺得先手，这样的气势连天地都会惊动。

守取外势，攻聚内力 
防 守的时候，尽可能防在外围，限制对方的空间，让他的棋没有发展前途。进攻则不能太分散子力，下得太*外，被对方占据要点，阻断子力联系，不能形成有效的进 攻。但攻聚内力并不等于放弃外围，使自己没有足够的空间进攻，守取外势也不能一味地在外围防守，而放弃内部必须占据的要点。

八卦易守，成角易攻 
八 卦就是由象棋四个马步形成的一种棋形，如果摆满全盘，则对方没有取胜的可能。还有一种说法叫“马步是强防”，既使不能摆满全盘，很多时候自己的棋子形成马 步的点就是强防点。成角易攻，角就是三个紧紧*在一起的棋子构成的直角三角形，成角的形状后子力可互相多次利用，进攻源源不断。

阻断分隔，稳如泰山 
这句话说的就是防守时的一种思想，阻断对方子力的联系，逐个击破。

不思争先，胜比登天 
仅仅*消极的防御是赢不了棋的，防御的时候时刻要考虑夺回先手。两个棋力相当的棋手，一盘五子棋比赛过程，就是互相争先手的过程。

初盘争二，局终抢三 
开局的时候双方都没有连续进攻取胜的手段，就需要在限制对方形成活二的基础上自己形成更多的活二，时机成熟，一举攻胜。到了局终双方各有些活二、眠三，这时有些三就要先活，有些眠三就要先冲，占据空间要点，切断对方子力联系。

留三不冲，变化万千 
有 很多初学五子棋的朋友是有三必冲的，殊不知在鞘中的剑才是最强的剑，冲四犹如宝剑出鞘，如果不能一击致命，出鞘之后的剑就没有威力了。留三不冲，你的这个 冲就有两个点（一个连冲，一个跳冲）可以利用，相应对方防守的子也会少一个。有时把冲了以后活三改为直接叫四三，可以收到更好的效果。

多个先手，细算次先 
五子要点，次序在前 
这里说的是顺序问题。同样的棋，顺序对了可以取胜，顺序错了没有胜棋，在实战中可以遇到这类情况。不要被自己很多可以活三冲四的棋看花了眼，认真计算正确的进攻顺序以及对方防守后会不会形成反三、反四。

斜线为阴，直线为阳 
阴阳结合，防不胜防 
新 手的朋友很容易忽视斜线的子力，斜线成五子同样取胜，可不能大意。善于进攻的棋手，能够做到直线和斜线相互配合，多角度的攻击能够大大增加进攻的杀伤力。 之所以说斜线是阴因为不同颜色的两条斜线可以交*互不影响，相反的不用颜色的两条直线就不可能交*，因为无法穿越对方。

连三连四，易见为明 
跳三跳四，暗剑深藏 
连三连四很容易看出，很多朋友却老是忽视跳活三、跳冲四的下法，不晓得跳出去又是另一片天空，跳出去进攻更具有隐蔽性。 这两句放在一起是告诉棋手，连和跳并没有一定之规，关键看临场的形势，但是千万不能忽略可任何一种可能性，否则就会错失良机。

己落一子，敌增一兵 
这 句话主要是说在进攻的时候不要忘记对方防守的子力，五子棋是你下一子，对方下一子，不比你少。你进攻一手棋，敌人防守一子，防守的棋子是不是会给你造成反 三、反四？会不会阻碍了你的后续进攻？所以下棋的时候一定要惜子如金，每一子都要发挥出最大的效力，千万不可随便将变化走完。

攻其要点，守其必争 
进攻的时候占据重要位置，下在可持续进攻的点。防守就要守在对方进攻过程中非常想占据的连接点，你想下的点，我来下。

势已形成，败即降临
高手对弈很多时候是我们看不懂的，因为他们所追求的是“势”，一种压制住对方而取得压倒性优势的情况，这个时候可能不能简单的杀，但是通过精准的计算可以立即将这种“势”转化为杀。 

五子精华，一子输赢 
有些朋友输了以后说“你成五子了，我也活四了，我只比你差一颗子嘛”。其实五子棋争的就是这一步棋，谁争得了先手下成五子，谁就获胜，这也是五子棋的魅力所在。不要以一子之差原谅自己，一子就已经可以使你输棋了。
	</div>
</div>
</div>
</body>
</html>